ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f67651a.h
/* RTCTCCTL0 Control Bits */
#define TCEN                (0x0001)   /* RTC Enable for RTC Tamper Detection with Time Stamp */
#define AUX3RST             (0x0002)   /* RTC Indication of power cycle on AUXVCC3 */

/* RTCTCCTL1 Control Bits */
#define RTCCAPIFG           (0x0001)   /* RTC  Tamper Event Interrupt Flag */
#define RTCCAPIE            (0x0002)   /* RTC Tamper Event Interrupt Enable */

/* RTCCAPxCTL Control Bits */
#define CAPEV               (0x0001)   /* RTC Tamper Event Flag */
#define CAPES               (0x0004)   /* RTC Event Edge Select */
#define RTCREN              (0x0008)   /* RTC RTCCAPx pin pullup/pulldown resistor enable */
#define RTCCAPIN            (0x0010)   /* RTC RTCCAPx input */
#define RTCCAPDIR           (0x0020)   /* RTC RTCCAPx Pin direction */
#define RTCCAPOUT           (0x0040)   /* RTC RTCCAPx Output */


/* RTCIV Definitions */
#define RTCIV_NONE         (0x0000)    /* No Interrupt pending */
#define RTCIV_RTCOFIFG     (0x0002)    /* RTC Osc fault: RTCOFIFG */
#define RTCIV_RTCCAPIFG    (0x0004)    /* RTC RTC Tamper Event: RTCCAPIFG */
#define RTCIV_RTCRDYIFG    (0x0006)    /* RTC ready: RTCRDYIFG */
#define RTCIV_RTCTEVIFG    (0x0008)    /* RTC interval timer: RTCTEVIFG */
#define RTCIV_RTCAIFG      (0x000A)    /* RTC user alarm: RTCAIFG */
#define RTCIV_RT0PSIFG     (0x000C)    /* RTC prescaler 0: RT0PSIFG */
#define RTCIV_RT1PSIFG     (0x000E)    /* RTC prescaler 1: RT1PSIFG */

/* Legacy RTCIV Definitions */
#define RTC_NONE           (0x0000)    /* No Interrupt pending */
#define RTC_RTCOFIFG       (0x0002)    /* RTC Osc fault: RTCOFIFG */
#define RTC_RTCRDYIFG      (0x0006)    /* RTC ready: RTCRDYIFG */
#define RTC_RTCTEVIFG      (0x0008)    /* RTC interval timer: RTCTEVIFG */
#define RTC_RTCAIFG        (0x000A)    /* RTC user alarm: RTCAIFG */
#define RTC_RT0PSIFG       (0x000C)    /* RTC prescaler 0: RT0PSIFG */
#define RTC_RT1PSIFG       (0x000E)    /* RTC prescaler 1: RT1PSIFG */

/************************************************************
* SD24_B - Sigma Delta 24 Bit
************************************************************/
#define __MSP430_HAS_SD24_B__         /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_SD24_B__ 0x0800
#define SD24_BASE __MSP430_BASEADDRESS_SD24_B__
#define __MSP430_HAS_SD24_B6__        /* Definition to show that Module is available */

#define SD24BCTL0_            0x0800    /* SD24B Control Register 0 */
sfrb(SD24BCTL0_L , SD24BCTL0_);
sfrb(SD24BCTL0_H , SD24BCTL0_+1);
sfrw(SD24BCTL0, SD24BCTL0_);
#define SD24BCTL1_            0x0802    /* SD24B Control Register 1 */
sfrb(SD24BCTL1_L , SD24BCTL1_);
sfrb(SD24BCTL1_H , SD24BCTL1_+1);
sfrw(SD24BCTL1, SD24BCTL1_);
#define SD24BTRGCTL_          0x0804    /* SD24B Trigger Control Register */
sfrb(SD24BTRGCTL_L , SD24BTRGCTL_);
sfrb(SD24BTRGCTL_H , SD24BTRGCTL_+1);
sfrw(SD24BTRGCTL, SD24BTRGCTL_);
#define SD24BTRGOSR_          0x0806    /* SD24B Trigger OSR Control Register */
sfrb(SD24BTRGOSR_L , SD24BTRGOSR_);
sfrb(SD24BTRGOSR_H , SD24BTRGOSR_+1);
sfrw(SD24BTRGOSR, SD24BTRGOSR_);
#define SD24BTRGPRE_          0x0808    /* SD24B Trigger Preload Register */
sfrb(SD24BTRGPRE_L , SD24BTRGPRE_);
sfrb(SD24BTRGPRE_H , SD24BTRGPRE_+1);
sfrw(SD24BTRGPRE, SD24BTRGPRE_);
#define SD24BIFG_             0x080A    /* SD24B Interrupt Flag Register */
sfrb(SD24BIFG_L , SD24BIFG_);
sfrb(SD24BIFG_H , SD24BIFG_+1);
sfrw(SD24BIFG, SD24BIFG_);
#define SD24BIE_              0x080C    /* SD24B Interrupt Enable Register */
sfrb(SD24BIE_L , SD24BIE_);
sfrb(SD24BIE_H , SD24BIE_+1);
sfrw(SD24BIE, SD24BIE_);
#define SD24BIV_              0x080E    /* SD24B Interrupt Vector Register */
sfrb(SD24BIV_L , SD24BIV_);
sfrb(SD24BIV_H , SD24BIV_+1);
sfrw(SD24BIV, SD24BIV_);

#define SD24BCCTL0_           0x0810    /* SD24B Channel 0 Control Register */
sfrb(SD24BCCTL0_L , SD24BCCTL0_);
sfrb(SD24BCCTL0_H , SD24BCCTL0_+1);
sfrw(SD24BCCTL0, SD24BCCTL0_);
#define SD24BINCTL0_          0x0812    /* SD24B Channel 0 Input Control Register */
sfrb(SD24BINCTL0_L , SD24BINCTL0_);
sfrb(SD24BINCTL0_H , SD24BINCTL0_+1);
sfrw(SD24BINCTL0, SD24BINCTL0_);
#define SD24BOSR0_            0x0814    /* SD24B Channel 0 OSR Control Register */
sfrb(SD24BOSR0_L , SD24BOSR0_);
sfrb(SD24BOSR0_H , SD24BOSR0_+1);
sfrw(SD24BOSR0, SD24BOSR0_);
#define SD24BPRE0_            0x0816    /* SD24B Channel 0 Preload Register */
sfrb(SD24BPRE0_L , SD24BPRE0_);
sfrb(SD24BPRE0_H , SD24BPRE0_+1);
sfrw(SD24BPRE0, SD24BPRE0_);
#define SD24BCCTL1_           0x0818    /* SD24B Channel 1 Control Register */
sfrb(SD24BCCTL1_L , SD24BCCTL1_);
sfrb(SD24BCCTL1_H , SD24BCCTL1_+1);
sfrw(SD24BCCTL1, SD24BCCTL1_);
#define SD24BINCTL1_          0x081A    /* SD24B Channel 1 Input Control Register */
sfrb(SD24BINCTL1_L , SD24BINCTL1_);
sfrb(SD24BINCTL1_H , SD24BINCTL1_+1);
sfrw(SD24BINCTL1, SD24BINCTL1_);
#define SD24BOSR1_            0x081C    /* SD24B Channel 1 OSR Control Register */
sfrb(SD24BOSR1_L , SD24BOSR1_);
sfrb(SD24BOSR1_H , SD24BOSR1_+1);
sfrw(SD24BOSR1, SD24BOSR1_);
#define SD24BPRE1_            0x081E    /* SD24B Channel 1 Preload Register */
sfrb(SD24BPRE1_L , SD24BPRE1_);
sfrb(SD24BPRE1_H , SD24BPRE1_+1);
sfrw(SD24BPRE1, SD24BPRE1_);
#define SD24BCCTL2_           0x0820    /* SD24B Channel 2 Control Register */
sfrb(SD24BCCTL2_L , SD24BCCTL2_);
sfrb(SD24BCCTL2_H , SD24BCCTL2_+1);
sfrw(SD24BCCTL2, SD24BCCTL2_);
#define SD24BINCTL2_          0x0822    /* SD24B Channel 2 Input Control Register */
sfrb(SD24BINCTL2_L , SD24BINCTL2_);
sfrb(SD24BINCTL2_H , SD24BINCTL2_+1);
sfrw(SD24BINCTL2, SD24BINCTL2_);
#define SD24BOSR2_            0x0824    /* SD24B Channel 2 OSR Control Register */
sfrb(SD24BOSR2_L , SD24BOSR2_);
sfrb(SD24BOSR2_H , SD24BOSR2_+1);
sfrw(SD24BOSR2, SD24BOSR2_);
#define SD24BPRE2_            0x0826    /* SD24B Channel 2 Preload Register */
sfrb(SD24BPRE2_L , SD24BPRE2_);
sfrb(SD24BPRE2_H , SD24BPRE2_+1);
sfrw(SD24BPRE2, SD24BPRE2_);
#define SD24BCCTL3_           0x0828    /* SD24B Channel 3 Control Register */
sfrb(SD24BCCTL3_L , SD24BCCTL3_);
sfrb(SD24BCCTL3_H , SD24BCCTL3_+1);
sfrw(SD24BCCTL3, SD24BCCTL3_);
#define SD24BINCTL3_          0x082A    /* SD24B Channel 3 Input Control Register */
sfrb(SD24BINCTL3_L , SD24BINCTL3_);
sfrb(SD24BINCTL3_H , SD24BINCTL3_+1);
sfrw(SD24BINCTL3, SD24BINCTL3_);
#define SD24BOSR3_            0x082C    /* SD24B Channel 3 OSR Control Register */
sfrb(SD24BOSR3_L , SD24BOSR3_);
sfrb(SD24BOSR3_H , SD24BOSR3_+1);
sfrw(SD24BOSR3, SD24BOSR3_);
#define SD24BPRE3_            0x082E    /* SD24B Channel 3 Preload Register */
sfrb(SD24BPRE3_L , SD24BPRE3_);
sfrb(SD24BPRE3_H , SD24BPRE3_+1);
sfrw(SD24BPRE3, SD24BPRE3_);
#define SD24BCCTL4_           0x0830    /* SD24B Channel 4 Control Register */
sfrb(SD24BCCTL4_L , SD24BCCTL4_);
sfrb(SD24BCCTL4_H , SD24BCCTL4_+1);
sfrw(SD24BCCTL4, SD24BCCTL4_);
#define SD24BINCTL4_          0x0832    /* SD24B Channel 4 Input Control Register */
sfrb(SD24BINCTL4_L , SD24BINCTL4_);
sfrb(SD24BINCTL4_H , SD24BINCTL4_+1);
sfrw(SD24BINCTL4, SD24BINCTL4_);
#define SD24BOSR4_            0x0834    /* SD24B Channel 4 OSR Control Register */
sfrb(SD24BOSR4_L , SD24BOSR4_);
sfrb(SD24BOSR4_H , SD24BOSR4_+1);
sfrw(SD24BOSR4, SD24BOSR4_);
#define SD24BPRE4_            0x0836    /* SD24B Channel 4 Preload Register */
sfrb(SD24BPRE4_L , SD24BPRE4_);
sfrb(SD24BPRE4_H , SD24BPRE4_+1);
sfrw(SD24BPRE4, SD24BPRE4_);
#define SD24BCCTL5_           0x0838    /* SD24B Channel 5 Control Register */
sfrb(SD24BCCTL5_L , SD24BCCTL5_);
sfrb(SD24BCCTL5_H , SD24BCCTL5_+1);
sfrw(SD24BCCTL5, SD24BCCTL5_);
#define SD24BINCTL5_          0x083A    /* SD24B Channel 5 Input Control Register */
sfrb(SD24BINCTL5_L , SD24BINCTL5_);
sfrb(SD24BINCTL5_H , SD24BINCTL5_+1);
sfrw(SD24BINCTL5, SD24BINCTL5_);
#define SD24BOSR5_            0x083C    /* SD24B Channel 5 OSR Control Register */
sfrb(SD24BOSR5_L , SD24BOSR5_);
sfrb(SD24BOSR5_H , SD24BOSR5_+1);
sfrw(SD24BOSR5, SD24BOSR5_);
#define SD24BPRE5_            0x083E    /* SD24B Channel 5 Preload Register */
sfrb(SD24BPRE5_L , SD24BPRE5_);
sfrb(SD24BPRE5_H , SD24BPRE5_+1);
sfrw(SD24BPRE5, SD24BPRE5_);

#define SD24BMEML0_           0x0850    /* SD24B Channel 0 Conversion Memory Low word */
sfrb(SD24BMEML0_L , SD24BMEML0_);
sfrb(SD24BMEML0_H , SD24BMEML0_+1);
sfrw(SD24BMEML0, SD24BMEML0_);
#define SD24BMEMH0_           0x0852    /* SD24B Channel 0 Conversion Memory High Word */
sfrb(SD24BMEMH0_L , SD24BMEMH0_);
sfrb(SD24BMEMH0_H , SD24BMEMH0_+1);
sfrw(SD24BMEMH0, SD24BMEMH0_);
#define SD24BMEML1_           0x0854    /* SD24B Channel 1 Conversion Memory Low word */
sfrb(SD24BMEML1_L , SD24BMEML1_);
sfrb(SD24BMEML1_H , SD24BMEML1_+1);
sfrw(SD24BMEML1, SD24BMEML1_);
#define SD24BMEMH1_           0x0856    /* SD24B Channel 1 Conversion Memory High Word */
sfrb(SD24BMEMH1_L , SD24BMEMH1_);
sfrb(SD24BMEMH1_H , SD24BMEMH1_+1);
sfrw(SD24BMEMH1, SD24BMEMH1_);
#define SD24BMEML2_           0x0858    /* SD24B Channel 2 Conversion Memory Low word */
sfrb(SD24BMEML2_L , SD24BMEML2_);
sfrb(SD24BMEML2_H , SD24BMEML2_+1);
sfrw(SD24BMEML2, SD24BMEML2_);
#define SD24BMEMH2_           0x085A    /* SD24B Channel 2 Conversion Memory High Word */
sfrb(SD24BMEMH2_L , SD24BMEMH2_);
sfrb(SD24BMEMH2_H , SD24BMEMH2_+1);
sfrw(SD24BMEMH2, SD24BMEMH2_);
#define SD24BMEML3_           0x085C    /* SD24B Channel 3 Conversion Memory Low word */
sfrb(SD24BMEML3_L , SD24BMEML3_);
sfrb(SD24BMEML3_H , SD24BMEML3_+1);
sfrw(SD24BMEML3, SD24BMEML3_);
#define SD24BMEMH3_           0x085E    /* SD24B Channel 3 Conversion Memory High Word */
sfrb(SD24BMEMH3_L , SD24BMEMH3_);
sfrb(SD24BMEMH3_H , SD24BMEMH3_+1);
sfrw(SD24BMEMH3, SD24BMEMH3_);
#define SD24BMEML4_           0x0860    /* SD24B Channel 4 Conversion Memory Low word */
sfrb(SD24BMEML4_L , SD24BMEML4_);
sfrb(SD24BMEML4_H , SD24BMEML4_+1);
sfrw(SD24BMEML4, SD24BMEML4_);
#define SD24BMEMH4_           0x0862    /* SD24B Channel 4 Conversion Memory High Word */
sfrb(SD24BMEMH4_L , SD24BMEMH4_);
sfrb(SD24BMEMH4_H , SD24BMEMH4_+1);
sfrw(SD24BMEMH4, SD24BMEMH4_);
#define SD24BMEML5_           0x0864    /* SD24B Channel 5 Conversion Memory Low word */
sfrb(SD24BMEML5_L , SD24BMEML5_);
sfrb(SD24BMEML5_H , SD24BMEML5_+1);
sfrw(SD24BMEML5, SD24BMEML5_);
#define SD24BMEMH5_           0x0866    /* SD24B Channel 5 Conversion Memory High Word */
sfrb(SD24BMEMH5_L , SD24BMEMH5_);
sfrb(SD24BMEMH5_H , SD24BMEMH5_+1);
sfrw(SD24BMEMH5, SD24BMEMH5_);


/* SD24BCTL0 */
#define SD24OV32            (0x0002)  /* SD24B Overflow Control */
#define SD24REFS            (0x0004)  /* SD24B Reference Select */
#define SD24SSEL0           (0x0010)  /* SD24B Clock Source Select 0 */
#define SD24SSEL1           (0x0020)  /* SD24B Clock Source Select 1 */
#define SD24M4              (0x0040)  /* SD24B Modulator clock to Manchester decoder clock ratio */
#define SD24CLKOS           (0x0080)  /* SD24B Clock Output Select */
#define SD24PDIV0           (0x0100)  /* SD24B Frequency pre-scaler Bit 0 */
#define SD24PDIV1           (0x0200)  /* SD24B Frequency pre-scaler Bit 1 */
#define SD24PDIV2           (0x0400)  /* SD24B Frequency pre-scaler Bit 2 */
#define SD24DIV0            (0x0800)  /* SD24B Frequency Divider Bit 0 */
#define SD24DIV1            (0x1000)  /* SD24B Frequency Divider Bit 1 */
#define SD24DIV2            (0x2000)  /* SD24B Frequency Divider Bit 2 */
#define SD24DIV3            (0x4000)  /* SD24B Frequency Divider Bit 3 */
#define SD24DIV4            (0x8000)  /* SD24B Frequency Divider Bit 4 */

#define SD24OV32_L          (0x0002)  /* SD24B Overflow Control */
#define SD24REFS_L          (0x0004)  /* SD24B Reference Select */
#define SD24SSEL0_L         (0x0010)  /* SD24B Clock Source Select 0 */
#define SD24SSEL1_L         (0x0020)  /* SD24B Clock Source Select 1 */
#define SD24M4_L            (0x0040)  /* SD24B Modulator clock to Manchester decoder clock ratio */
#define SD24CLKOS_L         (0x0080)  /* SD24B Clock Output Select */

#define SD24PDIV0_H         (0x0001)  /* SD24B Frequency pre-scaler Bit 0 */
#define SD24PDIV1_H         (0x0002)  /* SD24B Frequency pre-scaler Bit 1 */
#define SD24PDIV2_H         (0x0004)  /* SD24B Frequency pre-scaler Bit 2 */
#define SD24DIV0_H          (0x0008)  /* SD24B Frequency Divider Bit 0 */
#define SD24DIV1_H          (0x0010)  /* SD24B Frequency Divider Bit 1 */
#define SD24DIV2_H          (0x0020)  /* SD24B Frequency Divider Bit 2 */
#define SD24DIV3_H          (0x0040)  /* SD24B Frequency Divider Bit 3 */
#define SD24DIV4_H          (0x0080)  /* SD24B Frequency Divider Bit 4 */

#define SD24SSEL_0          (0x0000)  /* SD24B Clock Source Select MCLK  */
#define SD24SSEL_1          (0x0010)  /* SD24B Clock Source Select SMCLK */
#define SD24SSEL_2          (0x0020)  /* SD24B Clock Source Select ACLK  */
#define SD24SSEL_3          (0x0030)  /* SD24B Clock Source Select TACLK */
#define SD24SSEL__MCLK      (0x0000)  /* SD24B Clock Source Select MCLK  */
#define SD24SSEL__SMCLK     (0x0010)  /* SD24B Clock Source Select SMCLK */
#define SD24SSEL__ACLK      (0x0020)  /* SD24B Clock Source Select ACLK  */
#define SD24SSEL__SD24CLK   (0x0030)  /* SD24B Clock Source Select SD24CLK */

